Revit 2027 API
DividedPath.NumberOfPoints Property
 The total number of points of the divided surface. This combines the layout points and the intersection points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfPoints { get; }
Public ReadOnly Property NumberOfPoints As Integer
	Get
public:
property int NumberOfPoints {
	int get ();
}
member NumberOfPoints : int with get
Property Value
Int32
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace